src/cf/maERP_ib/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>БланкПодвал</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкШапка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логотип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизацииДиаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФонПечатныхФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСклад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/maERP_ib/src/Catalogs/Организации/Forms/ФормаЭлемента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеВРеквизитФормы(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьДеревоРеквизитовКонтрагента(Объект.Ссылка), "ДЗРеквизиты");
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Логотип = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Логотип");
	ФонПечатныхФорм = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ФонПечатныхФорм");
	ПечатьОрганизации = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ПечатьОрганизации");
	БланкШапка = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "БланкШапка");
	БланкПодвал = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "БланкПодвал");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(ДЗРеквизиты, Элементы.ДЗРеквизиты);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "Логотип", Логотип);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "ФонПечатныхФорм", ФонПечатныхФорм);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "ПечатьОрганизации", ПечатьОрганизации);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "БланкШапка", БланкШапка);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "БланкПодвал", БланкПодвал);
	РеквизитыКонтрагентов.ПередЗаписьюНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"), Отказ);
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РеквизитыКонтрагентов.ПриЗаписиНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"));
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма); 
	РеквизитыКонтрагентовКлиент.ОбработатьРезультатЗаполненияРеквизитовПоИНН(ЭтаФорма, ЗаполнитьПоИНННаСервере());
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизит(Команда)
	РеквизитыКонтрагентовКлиент.СформироватьМенюВыбораВидаРеквизита(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРеквизита(Команда)
	РеквизитыКонтрагентовКлиент.ОткрытьФормуВводаДополнительныхДанных(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВФактическийАдрес(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресФактический"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресДоставки(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресДоставки"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПроживания(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПроживания"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПоПрописке(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПоПрописке"));
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ВыборТаблицаФормы(ЭтаФорма, ВыбраннаяСтрока, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПриАктивизацииСтроки(Элемент)
	РеквизитыКонтрагентовКлиент.ПриАктивацииСтроки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ОбработкаВыбораТаблицаФормы(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПередНачаломИзменения(Элемент, Отказ)
	РеквизитыКонтрагентовКлиент.ПередНачаломИзменения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	ПрисоединённыеФайлыКлиент.ВыбратьИзображение(ЭтаФорма, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЛоготипУдалить(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, Логотип);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОрганизацииУдалить(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, ПечатьОрганизации);
КонецПроцедуры

&НаКлиенте
Процедура БланкШапкаУдалить(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, БланкШапка);
КонецПроцедуры

&НаКлиенте
Процедура БланкПодвалУдалить(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, БланкПодвал);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Функция ЗаполнитьПоИНННаСервере()
	Возврат РеквизитыКонтрагентов.ЗаполнитьРеквизитыПоИННВФорме(ЭтаФорма);
КонецФункции

&НаКлиенте
Процедура ФонПечатныхФормНажатие(Элемент, СтандартнаяОбработка)
	ПрисоединённыеФайлыКлиент.ВыбратьИзображение(ЭтаФорма, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФонУдалить(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, ФонПечатныхФорм);
КонецПроцедуры
	
#КонецОбласти
